Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/employment_support_schemes/community_employment_scheme.html.txt.tmx
Source language: en
Languages: ga

source: However, the rules on change of circumstances that apply to your original social welfare payment also apply to your CE payment
ga: Áfach, baineann na rialacha le haghaidh athraithe i do chúinsí féin le do bhuníocaíocht leasa shóisialaigh le d’íocaíocht FP freisin

source: For example, if your qualified adult gets a job, their income will be assessed as means and your CE payment may be reduced
ga: Mar shampla, má fhaigheann do dhuine fásta cáilithe post, déanfar a n-ioncam a mheas mar acmhainní agus d'fhéadfadh go laghdófar d’íocaíocht FP

source: Your CE payment cannot be reduced below the minimum rate of €215.50
ga: Ní fhéadfadh í faoi bhun an íosráta €208 a laghdaigh

source: In order to avoid any possible overpayments, if there is any change in your circumstances, you should immediately inform your CE supervisor and the local DSP Community Development Officer responsible for your CE scheme
ga: Chun ró-íocaíocht a sheachaint, má tá aon athrú i do chúinsí féin, ba chóir duit cuir in iúl do mhaoirseoir FP agus an tOifigeach Forbartha Pobail RCP áitiúil atá freagrach as do scéim FP

source: (Your CE supervisor will give you contact details for the local DSP Community Development Officer.) There is more information about change of circumstances in section 3.2.6 of the Community Employment Procedures Manual
ga: (Tugann do mhaoirseoir FP thú sonraí teagmhála den Oifigeach Forbartha Pobail RCP áitiúil.) Tá tuilleadh faisnéise maidir le hathrú i do chúinsí féin in alt 3.2.6 ar fáil an Lámhleabhar Nósanna Imeachta Fostaíocht Pobail

source: Spouses or partners and CE: If you are on a CE scheme and your spouse or partner gets a place on a CE scheme, you will each get a single rate of the CE payment together with half of the Increases for a Qualified Child for any dependent children
ga: Céilí nó páirtnéirí agus FP: Má tá tú ar scéim FP agus má fhaigheann do chéile nó do pháirtnéir áit ar scéim FP, gheobhaidh gach duine agaibh ráta singil íocaíochta FP chomh maith le leath a Mhéadú Linbh Cáilithe le haghaidh aon linbh cleithiúnach

source: There are a limited number of Community Employment (CE) places available
ga: Tá líon teoranta postanna ar fáil mar chuid den Scéim Fostaíochta Pobail (FP)

source: If you want to participate in a CE scheme contact your local Intreo Centre for information about CE job opportunities
ga: Más mian leat páirt a ghlacadh i Scéim FP déan teagmháil le d'oifig seirbhísí fostaíochta áitiúil chun dheiseanna fostaíochta faoin Scéim FP a fháil

source: Job listings are also available online
ga: Tá liostaí fostaíochta ar fáil ar an idirlín

source: Voluntary organisations and public bodies may sponsor CE projects which are for community and public benefit
ga: Is féidir le heagraíochtaí deonacha nó comhlachtaí poiblí urraíocht a dhéanamh ar thionscadail Fhostaíochta Pobail ar son sochair pobail agus poiblí

source: They should contact their local Intreo Centre for more information
ga: Ba chóir dóibh dul i dteagmháil leis an oifig seirbhísí fostaíochta áitiúil chun tuilleadh faisnéise a fháil

source: Leaving and re-entry to Community Employment
ga: Fágáil agus athiontráil ar Fhostaíocht Pobail

source: If you leave a CE scheme, you cannot participate in another CE scheme for 12 months after you leave and you must be getting a qualifying payment for those 12 months
ga: Má fhágann tú scéim FP, ní féidir leat páirt a ghlacadh i scéim FP eile ar feadh 12 mhí tar éis d’fhágáil. Caithfidh tú bheith ag fáil íocaíocht cáilithe le linn na 12 mhí seo

source: If you are being re-engaged, that is, if you are continuing for another year on your CE scheme, you are not required to have this 12-month break
ga: Má tá tú athfhostaithe, is é sin, má leanann tú ar feadh bliain eile ar do scéim FP, ní gá duit an briseadh 12 mhí a bheith agat

source: If you have the opportunity of full-time work you can take one period of temporary unpaid leave with your sponsor’s agreement for up to 26 weeks
ga: Má tá seans obair lánaimseartha agat agus má aontaíonn d’urraitheoir, is féidir tréimhse saoire neamhíoctha amháin suas go dtí 26 seachtain a fháil

source: If the work opportunity continues beyond 26 weeks, you must leave the CE scheme
ga: Má leanann an obair thar 26 seachtain, caithfidh tú an scéim FP a fhágáil

source: Contact your local Intreo Centre
ga: Déan teagmháil le d'ionad Intreo nó d'oifig seirbhísí fostaíochta áitiúil
